snlkuharlocal/src/Documents/Инвентаризация/Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвентаризация</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.СертификатныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.Партии</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладВременногоХранения</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПересчитыватьСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОприходования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПартии</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Им7</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтукВКоробе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Инвентаризация/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции
//++Данилова Е.В. 30.06.2026 Изм.№0000000174

// Назначение: Создает или изменяет документы Оприходование и Списание на основе инвентаризации.
//
// Параметры:
//  Инв - СправочникСсылка.Документы - ссылка на документ инвентаризации
//
// Возвращаемое значение:
//  СтруктураРезультат Тип("Структура") - результат выполнения функции

Функция СоздатьИзменитьПоИНВ_ОПР_СПН_(Знач Инв) Экспорт
	//
	СтруктураРезультат = МаркировкаКС.СтруктураРезультата(Ложь); 
	
	СтрокаРеквизитов 	= "НеФормироватьПроводки,Проведен,СостояниеНакладной"; 
	РеквизитыИнв 		= ОбщегоНазначенияС.ПолучитьРеквизитыШапкиСервер(Инв,СтрокаРеквизитов); 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОприходованиеТМЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОприходованиеТМЦ КАК ОприходованиеТМЦ
		|ГДЕ
		|	ОприходованиеТМЦ.Проведен
		|	И ОприходованиеТМЦ.ДокОснование = &ДокОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписаниеТМЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеТМЦ КАК СписаниеТМЦ
		|ГДЕ
		|	СписаниеТМЦ.Проведен
		|	И СписаниеТМЦ.ДокОснование = &ДокОснование";
	
	
	Запрос.УстановитьПараметр("ДокОснование", Инв);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	
	РезОпр 		= ПакетЗапросов[0].Выбрать(); 
	РезСписание = ПакетЗапросов[1].Выбрать();
	
	Если РезОпр.Следующий() Тогда
		Оприходование = РезОпр.ссылка.ПолучитьОбъект(); 
		Оприходование.Товары.Очистить(); 
	Иначе
		Оприходование = Документы.ОприходованиеТМЦ.СоздатьДокумент();
	КонецЕсли;
	
	Если РезСписание.Следующий() Тогда
		Списание = РезСписание.ссылка.ПолучитьОбъект();
		Списание.Товары.Очистить();
	Иначе
		Списание = Документы.СписаниеТМЦ.СоздатьДокумент();
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	               |	ИнвентаризацияТовары.Количество КАК Количество,
	               |	ИнвентаризацияТовары.Единица КАК Единица,
	               |	ИнвентаризацияТовары.Коэффициент КАК Коэффициент,
	               |	ИнвентаризацияТовары.Цена КАК Цена,
	               |	ИнвентаризацияТовары.Сумма КАК Сумма,
	               |	ИнвентаризацияТовары.Объем КАК Объем,
	               |	ИнвентаризацияТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ИнвентаризацияТовары.НДС КАК НДС,
	               |	ИнвентаризацияТовары.Всего КАК Всего,
	               |	ИнвентаризацияТовары.ЦенаОприходования КАК ЦенаОприходования,
	               |	ИнвентаризацияТовары.КоличествоОпр КАК КоличествоОпр
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&Товары КАК ИнвентаризацияТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	-ВТ.Количество КАК Количество,
	               |	ВТ.Единица КАК Единица,
	               |	ВТ.Коэффициент КАК Коэффициент,
	               |	ВТ.Цена КАК Цена,
	               |	-ВТ.Сумма КАК Сумма,
	               |	ВТ.Объем КАК Объем,
	               |	ВТ.СтавкаНДС КАК СтавкаНДС,
	               |	-ВТ.НДС КАК НДС,
	               |	-ВТ.Всего КАК Всего,
	               |	ВТ.ЦенаОприходования КАК ЦенаОприходования,
	               |	ВТ.КоличествоОпр КАК КоличествоОпр
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Количество < 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.Количество КАК Количество,
	               |	ВТ.Единица КАК Единица,
	               |	ВТ.Коэффициент КАК Коэффициент,
	               |	ВТ.Цена КАК Цена,
	               |	ВТ.Сумма КАК Сумма,
	               |	ВТ.Объем КАК Объем,
	               |	ВТ.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ.НДС КАК НДС,
	               |	ВТ.Всего КАК Всего,
	               |	ВТ.ЦенаОприходования КАК ЦенаОприходования,
	               |	ВТ.КоличествоОпр КАК КоличествоОпр
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Количество > 0";     
	Запрос.УстановитьПараметр("Товары",ИНВ.Товары.Выгрузить());
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	 
	РезДляСписания 		= ПакетЗапросов[1];
	РезДляОприходования = ПакетЗапросов[2];
	
	ДокДляЗаписи = Новый Массив; 
	
	Если Не РезДляСписания.Пустой() Тогда
		
		Выборка = РезДляСписания.Выбрать(); 
		
		ЗаполнитьЗначенияСвойств(Списание,ИНВ); 
		                 
		Списание.ДокОснование 	= ИНВ;
		Списание.КодОперации 	= Перечисления.КодыОперацийОстатки.Списание;
		Списание.Подразделение 	= ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Списание.Склад, "Подразделение",
			"Справочник");
		Списание.Дата 			= ТекущаяДатаСеанса();
		Списание.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена;

		Если Списание.ЭтоНовый() Тогда
			ОбщегоНазначенияКС.УстановитьНомерДокументаКлиентСервер_(Списание); 	
		КонецЕсли;
						   
		Пока Выборка.Следующий() цикл   
			
			СтрокаТЧ = Списание.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
		
		КонецЦикла;     
			
		ДокДляЗаписи.Добавить(Списание);
	
	КонецЕсли;

	Если Не РезДляОприходования.Пустой() Тогда
		
		Выборка = РезДляОприходования.Выбрать();
		
		ЗаполнитьЗначенияСвойств(Оприходование,ИНВ); 
		       
		Оприходование.ДокОснование = ИНВ;
		Оприходование.Подразделение = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Оприходование.Склад,
			"Подразделение", "Справочник");
		Оприходование.КодОперации = Перечисления.КодыОперацийОстатки.Оприходование;
		Оприходование.Дата = ТекущаяДатаСеанса();
		Оприходование.СостояниеНакладной = Перечисления.СостоянияНакладной.Принята;
		
		Если Оприходование.ЭтоНовый() Тогда 
			ОбщегоНазначенияКС.УстановитьНомерДокументаКлиентСервер_(Оприходование);   
		КонецЕсли;
		
		Пока Выборка.Следующий() цикл   
			
			СтрокаТЧ = Оприходование.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
		
		КонецЦикла;   	
		
		ДокДляЗаписи.Добавить(Оприходование);
	
	КонецЕсли;
	
	Если ДокДляЗаписи.Количество() > 0  Тогда
		
		Если НЕ РеквизитыИнв.НеФормироватьПроводки Тогда
		
			ИнвОбъект = Инв.ПолучитьОбъект(); 
			ИнвОбъект.НеФормироватьПроводки = Истина; 
			
			ДокДляЗаписи.Вставить(0,ИнвОбъект);  
			
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Для Каждого ДокЗаписи Из ДокДляЗаписи Цикл
			Попытка
				ДокЗаписи.Записать(РежимЗаписиДокумента.Проведение); 
			Исключение
				СтруктураРезультат.Ошибки.Добавить(ОписаниеОшибки());
			КонецПопытки;
			
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			
			ЗафиксироватьТранзакцию();
		
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураРезультат.Успешно = СтруктураРезультат.Ошибки.Количество() = 0; 
	
	Возврат СтруктураРезультат;  
	
КонецФункции

Функция НеобходимоСоздатьОПР_СПН(Знач Инв) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инвентаризация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка = &Ссылка
	|	И Инвентаризация.Проведен
	|	И Инвентаризация.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена)
	|	И Инвентаризация.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипСклада.КомиссионныйСклад)
	|	И Инвентаризация.Склад.КодФизическогоУзла В (&КодФизическогоУзла)";
	
	КодУзла = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.ЭтотУзел, "Код"); 
	КодФизическогоУзла = Новый Массив; 
	КодФизическогоУзла.Добавить(КодУзла);
	КодФизическогоУзла.Добавить("");
	
	Запрос.УстановитьПараметр("КодФизическогоУзла", КодФизическогоУзла);
	Запрос.УстановитьПараметр("Ссылка", ИНВ);
	

	РезультатЗапроса = Запрос.Выполнить();

	Возврат Не РезультатЗапроса.Пустой(); 
	
КонецФункции

Процедура СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне(Знач ДокРегистрации, Знач ВерсияДанных, Знач ИдентификаторФЗ) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ДокРегистрации);
	МассивПараметров.Добавить(ВерсияДанных);

	ФоновыеЗадания.Выполнить("Регламент.ПроверкаВерсииИНВПередСозданиемОПР_СПН", МассивПараметров, ИдентификаторФЗ,
		"СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне");	
КонецПроцедуры
//--Данилова Е.В. 30.06.2026
#КонецОбласти
